cmsis-svd/cmsis-svd/data/Nuvoton/M058SAN_v1.svd
       <register derivedFrom="P0_IEN">
          <name>P4_IEN</name>
          <displayName>P4_IEN</displayName>
		  <description>P4 Interrupt Enable</description>
          <addressOffset>0x11C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P4_ISRC</name>
          <displayName>P4_ISRC</displayName>
		  <description>P4 Interrupt Source Flag</description>
          <addressOffset>0x120</addressOffset>
       </register>
       <register>
          <name>DBNCECON</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>DBNCECON</displayName>
          <description>De-bounce Cycle Control</description>
          <addressOffset>0x180</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBCLKSEL</name>
              <description>De-bounce sampling cycle selection\n</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBCLKSRC</name>
              <description>De-bounce counter clock source select\n</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>De-bounce counter clock source is the HCLK</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>De-bounce counter clock source is the internal 10kHz clock</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>ICLK_ON</name>
              <description>Interru\nIt is recommended to turn off this bit to save system power, if on special application concern.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Edge detection circuit is active only if IO pin corresponding GPIOx_IEN bit is set to 1</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>All IO pins edge detection circuit is always active after reset</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register>
          <name>P00_DOUT</name>
          <!-- the display name is an unrestricted string. -->
          <displayName>P00_DOUT</displayName>
          <description>P0.0 Data Output Value</description>
          <addressOffset>0x200</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>Pxn_PDIO</name>
              <description>GPIO Px.n Pin Data Input/Output\nWrite this bit can control one GPIO pin output value\nRead this register to get GPIO pin status.\nFor example: write P00_PDIO will reflect the written value to bit P0_DOUT[0], read P00_PDIO will return the value of P0_PIN[0]\nNote: The write operation will not be affected by register Px_DMASK</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                 <enumeratedValue>
                    <name>0</name>
                    <description>Set corresponding GPIO pin to low</description>
                    <value>#0</value>
                 </enumeratedValue>
                 <enumeratedValue>
                    <name>1</name>
                    <description>Set corresponding GPIO pin to high</description>
                    <value>#1</value>
                 </enumeratedValue>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P01_DOUT</name>
          <displayName>P01_DOUT</displayName>
		  <description>P0.1 Data Output Value</description>
          <addressOffset>0x204</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P02_DOUT</name>
          <displayName>P02_DOUT</displayName>
		  <description>P0.2 Data Output Value</description>
          <addressOffset>0x208</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P03_DOUT</name>
          <displayName>P03_DOUT</displayName>
		  <description>P0.3 Data Output Value</description>
          <addressOffset>0x20C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P04_DOUT</name>
          <displayName>P04_DOUT</displayName>
		  <description>P0.4 Data Output Value</description>
          <addressOffset>0x210</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P05_DOUT</name>
          <displayName>P05_DOUT</displayName>
		  <description>P0.5 Data Output Value</description>
          <addressOffset>0x214</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P06_DOUT</name>
          <displayName>P06_DOUT</displayName>
		  <description>P0.6 Data Output Value</description>
          <addressOffset>0x218</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P07_DOUT</name>
          <displayName>P07_DOUT</displayName>
		  <description>P0.7 Data Output Value</description>
          <addressOffset>0x21C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P10_DOUT</name>
          <displayName>P10_DOUT</displayName>
		  <description>P1.0 Data Output Value</description>
          <addressOffset>0x220</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P11_DOUT</name>
          <displayName>P11_DOUT</displayName>
		  <description>P1.1 Data Output Value</description>
          <addressOffset>0x224</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P12_DOUT</name>
          <displayName>P12_DOUT</displayName>
		  <description>P1.2 Data Output Value</description>
          <addressOffset>0x228</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P13_DOUT</name>
          <displayName>P13_DOUT</displayName>
		  <description>P1.3 Data Output Value</description>
          <addressOffset>0x22C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P14_DOUT</name>
          <displayName>P14_DOUT</displayName>
		  <description>P1.4 Data Output Value</description>
          <addressOffset>0x230</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P15_DOUT</name>
          <displayName>P15_DOUT</displayName>
		  <description>P1.5 Data Output Value</description>
          <addressOffset>0x234</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P16_DOUT</name>
          <displayName>P16_DOUT</displayName>
		  <description>P1.6 Data Output Value</description>
          <addressOffset>0x238</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P17_DOUT</name>
          <displayName>P17_DOUT</displayName>
		  <description>P1.7 Data Output Value</description>
          <addressOffset>0x23C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P20_DOUT</name>
          <displayName>P20_DOUT</displayName>
		  <description>P2.0 Data Output Value</description>
          <addressOffset>0x240</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P21_DOUT</name>
          <displayName>P21_DOUT</displayName>
		  <description>P2.1 Data Output Value</description>
          <addressOffset>0x244</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P22_DOUT</name>
          <displayName>P22_DOUT</displayName>
		  <description>P2.2 Data Output Value</description>
          <addressOffset>0x248</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P23_DOUT</name>
          <displayName>P23_DOUT</displayName>
		  <description>P2.3 Data Output Value</description>
          <addressOffset>0x24C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P24_DOUT</name>
          <displayName>P24_DOUT</displayName>
		  <description>P2.4 Data Output Value</description>
          <addressOffset>0x250</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P25_DOUT</name>
          <displayName>P25_DOUT</displayName>
		  <description>P2.5 Data Output Value</description>
          <addressOffset>0x254</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P26_DOUT</name>
          <displayName>P26_DOUT</displayName>
		  <description>P2.6 Data Output Value</description>
          <addressOffset>0x258</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P27_DOUT</name>
          <displayName>P27_DOUT</displayName>
		  <description>P2.7 Data Output Value</description>
          <addressOffset>0x25C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P30_DOUT</name>
          <displayName>P30_DOUT</displayName>
		  <description>P3.0 Data Output Value</description>
          <addressOffset>0x260</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P31_DOUT</name>
          <displayName>P31_DOUT</displayName>
		  <description>P3.1 Data Output Value</description>
          <addressOffset>0x264</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P32_DOUT</name>
          <displayName>P32_DOUT</displayName>
		  <description>P3.2 Data Output Value</description>
          <addressOffset>0x268</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P33_DOUT</name>
          <displayName>P33_DOUT</displayName>
		  <description>P3.3 Data Output Value</description>
          <addressOffset>0x26C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P34_DOUT</name>
          <displayName>P34_DOUT</displayName>
		  <description>P3.4 Data Output Value</description>
          <addressOffset>0x270</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P35_DOUT</name>
          <displayName>P35_DOUT</displayName>
		  <description>P3.5 Data Output Value</description>
          <addressOffset>0x274</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P36_DOUT</name>
          <displayName>P36_DOUT</displayName>
		  <description>P3.6 Data Output Value</description>
          <addressOffset>0x278</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P37_DOUT</name>
          <displayName>P37_DOUT</displayName>
		  <description>P3.7 Data Output Value</description>
          <addressOffset>0x27C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P40_DOUT</name>
          <displayName>P40_DOUT</displayName>
		  <description>P4.0 Data Output Value</description>
          <addressOffset>0x280</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P41_DOUT</name>
          <displayName>P41_DOUT</displayName>
		  <description>P4.1 Data Output Value</description>
          <addressOffset>0x284</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P42_DOUT</name>
          <displayName>P42_DOUT</displayName>
		  <description>P4.2 Data Output Value</description>
          <addressOffset>0x288</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P43_DOUT</name>
          <displayName>P43_DOUT</displayName>
		  <description>P4.3 Data Output Value</description>
          <addressOffset>0x28C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P44_DOUT</name>
          <displayName>P44_DOUT</displayName>
		  <description>P4.4 Data Output Value</description>
          <addressOffset>0x290</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P45_DOUT</name>
          <displayName>P45_DOUT</displayName>
		  <description>P4.5 Data Output Value</description>
          <addressOffset>0x294</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P46_DOUT</name>
          <displayName>P46_DOUT</displayName>
		  <description>P4.6 Data Output Value</description>
          <addressOffset>0x298</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P47_DOUT</name>
          <displayName>P47_DOUT</displayName>
		  <description>P4.7 Data Output Value</description>
          <addressOffset>0x29C</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P5_PMD</name>
          <displayName>P5_PMD</displayName>
		  <description>P5 Pin I/O Mode Control</description>
          <addressOffset>0x2C0</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P5_OFFD</name>
          <displayName>P5_OFFD</displayName>
		  <description>P5 Digital Input Path Disable Control</description>
          <addressOffset>0x2C4</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P5_DOUT</name>
          <displayName>P5_DOUT</displayName>
		  <description>P5 Data Output Value</description>
          <addressOffset>0x2C8</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P5_DMASK</name>
          <displayName>P5_DMASK</displayName>
		  <description>P5 Data Output Write Mask</description>
          <addressOffset>0x2CC</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P5_PIN</name>
          <displayName>P5_PIN</displayName>
		  <description>P5 Pin Value</description>
          <addressOffset>0x2D0</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P5_DBEN</name>
          <displayName>P5_DBEN</displayName>
		  <description>P5 De-bounce Enable</description>
          <addressOffset>0x2D4</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P5_IMD</name>
          <displayName>P5_IMD</displayName>
		  <description>P5 Interrupt Mode Control</description>
          <addressOffset>0x2D8</addressOffset>
       </register>
