cmsis-svd/cmsis-svd/data/Nuvoton/M058SAN_v1.svd
       <register derivedFrom="P0_IEN">
          <name>P5_IEN</name>
          <displayName>P5_IEN</displayName>
		  <description>P5 Interrupt Enable</description>
          <addressOffset>0x2DC</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P5_ISRC</name>
          <displayName>P5_ISRC</displayName>
		  <description>P5 Interrupt Source Flag</description>
          <addressOffset>0x2E0</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P6_PMD</name>
          <displayName>P6_PMD</displayName>
	      <description>P6 Pin I/O Mode Control</description>
          <addressOffset>0x300</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P6_OFFD</name>
          <displayName>P6_OFFD</displayName>
		  <description>P6 Digital Input Path Disable Control</description>
          <addressOffset>0x304</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P6_DOUT</name>
          <displayName>P6_DOUT</displayName>
		  <description>P6 Data Output Value</description>
          <addressOffset>0x308</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P6_DMASK</name>
          <displayName>P6_DMASK</displayName>
		  <description>P6 Data Output Write Mask</description>
          <addressOffset>0x30C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P6_PIN</name>
          <displayName>P6_PIN</displayName>
		  <description>P6 Pin Value</description>
          <addressOffset>0x310</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P6_DBEN</name>
          <displayName>P6_DBEN</displayName>
		  <description>P6 De-bounce Enable</description>
          <addressOffset>0x314</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P6_IMD</name>
          <displayName>P6_IMD</displayName>
		  <description>P6 Interrupt Mode Control</description>
          <addressOffset>0x318</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P6_IEN</name>
          <displayName>P6_IEN</displayName>
		  <description>P6 Interrupt Enable</description>
          <addressOffset>0x31C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P6_ISRC</name>
          <displayName>P6_ISRC</displayName>
		  <description>P6 Interrupt Source Flag</description>
          <addressOffset>0x320</addressOffset>
       </register>
       <register derivedFrom="P0_PMD">
          <name>P7_PMD</name>
          <displayName>P7_PMD</displayName>
		  <description>P7 Pin I/O Mode Control</description>
          <addressOffset>0x340</addressOffset>
       </register>
       <register derivedFrom="P0_OFFD">
          <name>P7_OFFD</name>
          <displayName>P7_OFFD</displayName>
		  <description>P7 Digital Input Path Disable Control</description>
          <addressOffset>0x344</addressOffset>
       </register>
       <register derivedFrom="P0_DOUT">
          <name>P7_DOUT</name>
          <displayName>P7_DOUT</displayName>
		  <description>P7 Data Output Value</description>
          <addressOffset>0x348</addressOffset>
       </register>
       <register derivedFrom="P0_DMASK">
          <name>P7_DMASK</name>
          <displayName>P7_DMASK</displayName>
		  <description>P7 Data Output Write Mask</description>
          <addressOffset>0x34C</addressOffset>
       </register>
       <register derivedFrom="P0_PIN">
          <name>P7_PIN</name>
          <displayName>P7_PIN</displayName>
		  <description>P7 Pin Value</description>
          <addressOffset>0x350</addressOffset>
       </register>
       <register derivedFrom="P0_DBEN">
          <name>P7_DBEN</name>
          <displayName>P7_DBEN</displayName>
		  <description>P7 De-bounce Enable</description>
          <addressOffset>0x354</addressOffset>
       </register>
       <register derivedFrom="P0_IMD">
          <name>P7_IMD</name>
          <displayName>P7_IMD</displayName>
		  <description>P7 Interrupt Mode Control</description>
          <addressOffset>0x358</addressOffset>
       </register>
       <register derivedFrom="P0_IEN">
          <name>P7_IEN</name>
          <displayName>P7_IEN</displayName>
		  <description>P7 Interrupt Enable</description>
          <addressOffset>0x35C</addressOffset>
       </register>
       <register derivedFrom="P0_ISRC">
          <name>P7_ISRC</name>
          <displayName>P7_ISRC</displayName>
		  <description>P7 Interrupt Source Flag</description>
          <addressOffset>0x360</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P50_DOUT</name>
          <displayName>P50_DOUT</displayName>
		  <description>P5.0 Data Output Value</description>
          <addressOffset>0x380</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P51_DOUT</name>
          <displayName>P51_DOUT</displayName>
		  <description>P5.1 Data Output Value</description>
          <addressOffset>0x384</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P52_DOUT</name>
          <displayName>P52_DOUT</displayName>
		  <description>P5.2 Data Output Value</description>
          <addressOffset>0x388</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P53_DOUT</name>
          <displayName>P53_DOUT</displayName>
		  <description>P5.3 Data Output Value</description>
          <addressOffset>0x38C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P54_DOUT</name>
          <displayName>P54_DOUT</displayName>
		  <description>P5.4 Data Output Value</description>
          <addressOffset>0x390</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P55_DOUT</name>
          <displayName>P55_DOUT</displayName>
		  <description>P5.5 Data Output Value</description>
          <addressOffset>0x394</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P56_DOUT</name>
          <displayName>P56_DOUT</displayName>
		  <description>P5.6 Data Output Value</description>
          <addressOffset>0x398</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P57_DOUT</name>
          <displayName>P57_DOUT</displayName>
		  <description>P5.7 Data Output Value</description>
          <addressOffset>0x39C</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P60_DOUT</name>
          <displayName>P60_DOUT</displayName>		  
		  <description>P6.0 Data Output Value</description>
          <addressOffset>0x3A0</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P61_DOUT</name>
          <displayName>P61_DOUT</displayName>
		  <description>P6.1 Data Output Value</description>
          <addressOffset>0x3A4</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P62_DOUT</name>
          <displayName>P62_DOUT</displayName>
		  <description>P6.2 Data Output Value</description>
          <addressOffset>0x3A8</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P63_DOUT</name>
          <displayName>P63_DOUT</displayName>
		  <description>P6.3 Data Output Value</description>
          <addressOffset>0x3AC</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P64_DOUT</name>
          <displayName>P64_DOUT</displayName>
		  <description>P6.4 Data Output Value</description>
          <addressOffset>0x3B0</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P65_DOUT</name>
          <displayName>P65_DOUT</displayName>
		  <description>P6.5 Data Output Value</description>
          <addressOffset>0x3B4</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P66_DOUT</name>
          <displayName>P66_DOUT</displayName>
		  <description>P6.6 Data Output Value</description>
          <addressOffset>0x3B8</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P67_DOUT</name>
          <displayName>P67_DOUT</displayName>
		  <description>P6.7 Data Output Value</description>
          <addressOffset>0x3BC</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P70_DOUT</name>
          <displayName>P70_DOUT</displayName>		  
		  <description>P7.0 Data Output Value</description>
          <addressOffset>0x3C0</addressOffset>
       </register>
       <register derivedFrom="P00_DOUT">
          <name>P71_DOUT</name>
          <displayName>P71_DOUT</displayName>
		  <description>P7.1 Data Output Value</description>
          <addressOffset>0x3C4</addressOffset>
       </register>
